{"name": "Lyra", "faction": "Arcane", "description": "Born into an ancient order of mages, Lyra mastered the lost art of rune weaving, channeling raw magical energy into powerful spells. Her connection to the arcane runes allows her to manipulate the very fabric of reality. Legends say she has walked between dimensions, gathering knowledge that no mortal should possess. With each battle, the runes on her skin glow brighter, marking her as a living conduit of mystical power.", "imageUrl": "/characters/Lyra.jpg"}
{"name": "Seraphine", "faction": "Arcane","description": "Seraphine’s power comes from an ethereal source, a connection to a mystical plane where enchantments and spells flow like rivers. She was once a scholar who delved too deep into the secrets of the enchanted realm, transforming herself into a vessel of magical might. Now, she moves with grace, her every step leaving trails of shimmering energy, ready to defend the arcane secrets from those who seek to corrupt them.", "imageUrl": "/characters/Seraphine.jpg"}
{"name": "Kaelan", "faction": "Arcane","description": "A warrior by birth, Kaelan was chosen by the High Mages to bear the Sword of Eternity, a legendary weapon infused with ancient magic. His destiny was forged in battle as he now stands as a guardian of the magical realms, wielding both arcane power and martial skill. The arcane glyphs etched into his armor are not mere symbols, but ancient incantations that amplify his strength and control over magic.", "imageUrl": "/characters/Kaelan.jpg"}
{"name": "Jaxon", "faction": "Storm","description": "Once a mercenary, Jaxon’s life changed when he salvaged a mysterious piece of alien technology that upgraded his armor and weapons beyond anything his world had ever seen. Now, as the self-proclaimed Techno Warlord, he leads the Storm Faction’s most feared battalion. His armor’s electrical surges and heavy firepower make him an unstoppable force, crushing any who stand against the rise of technology.", "imageUrl": "/characters/Jaxon.jpg"}
{"name": "Nyra", "faction": "Storm", "description": "Engineered for combat, Nyra was part of a top-secret cybernetics program, designed to create the perfect soldier. With enhanced reflexes and a direct neural link to her drones, she commands the battlefield with cold efficiency. Though more machine than human now, Nyra retains a deep sense of loyalty to her faction and fights to protect their technological superiority at any cost.", "imageUrl": "/characters/Nyra.jpg"}
{"name": "Zara", "faction": "Storm", "description": "Zara was once a scientist on the cutting edge of energy manipulation, but an experiment gone wrong fused her with pure electricity. Now, she channels raw power through her body, wielding lightning as a weapon and moving faster than the eye can track. Her suit, designed to stabilize her abilities, allows her to focus her immense power with precision, making her one of the most feared warriors in the Storm Faction.", "imageUrl": "/characters/Zara.jpg"}